app/Helpers/CIFunctions_helper.php

    function get_user()
    {
        if (CIAuth::check()) {
            $user = new User();
            return $user->asObject()->where('id', CIAuth::id())->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1

    function get_settings()
    {
        $settings = new Setting();
        $settings_data = $settings->asObject()->first();
---
SELECT *
FROM `settings`
 LIMIT 1

    function get_parent_categories()
    {
        $category = new Category();
        return $category->asObject()->orderBy('ordering', 'asc')->findAll();
---
SELECT *
FROM `categories`
ORDER BY `ordering` ASC

    function get_subcategories_by_parent_category_id($id)
    {
        $subcategory = new SubCategory();
        return $subcategory->asObject()->orderBy('ordering', 'asc')->where('parent_cat', $id)->findAll();
---
SELECT *
FROM `sub_categories`
WHERE `parent_cat` = '4'
ORDER BY `ordering` ASC

    function get_dependent_subcategories()
    {
        $subcategory = new SubCategory();
        return $subcategory->asObject()->orderBy('ordering', 'asc')->where('parent_cat =', 0)->findAll();
---
SELECT *
FROM `sub_categories`
WHERE `parent_cat` = 0
ORDER BY `ordering` ASC

    function get_home_main_latest_post()
    {
        $post = new Post();
        return $post->asObject()->where('visibility', 1)->orderBy('created_at', 'desc')->first();
---
SELECT *
FROM `posts`
WHERE `visibility` = 1
ORDER BY `created_at` DESC
 LIMIT 1

    function get_6_home_latest_posts()
    {
        $post = new Post();
        return $post->asObject()->where('visibility', 1)->limit(6, 1)->orderBy('created_at', 'desc')->get()->getResult();
---
SELECT *
FROM `posts`
WHERE `visibility` = 1
ORDER BY `created_at` DESC
 LIMIT 1, 6

    function get_sidebar_random_posts($max = 4)
    {
        $post = new Post();
        return $post->asObject()->where('visibility', 1)->limit($max)->orderBy('rand()')->get()->getResult();
---
SELECT *
FROM `posts`
WHERE `visibility` = 1
ORDER BY rand()
 LIMIT 4

    function get_sidebar_categories()
    {
        $subcat = new SubCategory();
        return $subcat->asObject()->orderBy('name', 'asc')->findAll();
---
SELECT *
FROM `sub_categories`
ORDER BY `name` ASC

    function posts_by_category_id($id)
    {
        $post = new Post();
        $posts = $post->where('visibility', 1)->where('category_id', $id)->findAll();
---
SELECT *
FROM `posts`
WHERE `visibility` = 1
AND `category_id` = '5'

    function sidebar_latest_posts($except = null)
    {
        $post = new Post();
        return $post->where('visibility', 1)->where('id !=', $except)->orderBy('created_at', 'desc')->limit(4)->get()->getResult();
---
SELECT *
FROM `posts`
WHERE `visibility` = 1
AND `id` IS NOT NULL
ORDER BY `created_at` DESC
 LIMIT 4

    function get_tags()
    {
        $post = new Post();
        $tagsArray = [];
        $posts = $post->asObject()->where('visibility', 1)->where('tags !=', '')->orderBy('created_at', 'desc')->findAll();
---
SELECT *
FROM `posts`
WHERE `visibility` = 1
AND `tags` != ''
ORDER BY `created_at` DESC