app/Controllers/AdminController.php

INSERT INTO `categories` (`name`) VALUES ('aa')
---
    public function addCategory()
    {
        $request = \Config\Services::request();

        if ($request->isAJAX()) {
            $validation = \Config\Services::validation();

            $this->validate([
                'category_name' => [
                    'rules' => 'required|is_unique[categories.name]',
                    'errors' => [
                        'required' => 'Category Name is required',
                        'is_unique' => 'Category Name is already exists',
                    ]
                ],
            ]);

            if ($validation->run() === FALSE) {
                $errors = $validation->getErrors();
                return json_encode([
                    'status' => 0,
                    'token' => csrf_hash(),
                    'error' => $errors
                ]);
            } else {
                $category = new Category();
                $save = $category->save([
                    'name' => $request->getVar('category_name')
                ]);

SELECT *
FROM `sub_categories`
WHERE `parent_cat` = 1
---
    public function getCategories()
    {
        //! DB Detail
        $dbDetails = array(
            "host" => $this->db->hostname,
            "user" => $this->db->username,
            "pass" => $this->db->password,
            "db" => $this->db->database,
        );

        $table = "categories";
        $primaryKey = "id";
        $columns = array(
            array(
                "db" => "id",
                "dt" => 0
            ),
            array(
                "db" => "name",
                "dt" => 1
            ),
            array(
                "db" => "id",
                "dt" => 2,
                "formatter" => function ($d, $row) {
                    // return "(x) will be added later";
                    $subcategory = new SubCategory();
                    $subcategories = $subcategory->where(['parent_cat' => $row['id']])->findAll();

SELECT *
FROM `sub_categories`
WHERE `id` = 1
 LIMIT 1
---
    public function getSubCategories()
    {
        $category = new Category();
        $subcategory = new SubCategory();

        //! DB Detail
        $dbDetails = array(
            "host" => $this->db->hostname,
            "user" => $this->db->username,
            "pass" => $this->db->password,
            "db" => $this->db->database,
        );

        $table = "sub_categories";
        $primaryKey = "id";
        $columns = array(
            array(
                "db" => "id",
                "dt" => 0
            ),
            array(
                "db" => "name",
                "dt" => 1
            ),
            array(
                "db" => "id",
                "dt" => 2,
                "formatter" => function ($d, $row) use ($category, $subcategory) {
                    $parent_cat_id = $subcategory->asObject()->where("id", $row['id'])->first()->parent_cat;

SELECT *
FROM `sub_categories`
---
    public function addPost()
    {
        $subcategory = new SubCategory();
        $data = [
            'tabTitle' => 'Add New Post',
            'categories' => $subcategory->asObject()->findAll(),

SELECT *
FROM `sub_categories`
---
    public function allPost()
    {
        $subcategory = new SubCategory();
        $data = [
            'tabTitle' => 'All Post',
            'categories' => $subcategory->asObject()->findAll(),