app/Controllers/BlogController.php

    public function categoryPosts($category_slug)
    {
        $subcat = new SubCategory();
        $subcategory = $subcat->asObject()->where('slug', $category_slug)->first();
        $post = new Post();

        $data = [];
        $data['tabTitle'] = $subcategory->name;
        $data['category'] = $subcategory;
        $data['page'] = isset($_GET['page']) ? (int) $_GET['page'] : 1;
        $data['perPage'] = 6;
        $data['total'] = count($post->where('visibility', 1)->where('category_id', $subcategory->id)->findAll());
        $data['posts'] = $post->asObject()->where('visibility', 1)->where('category_id', $subcategory->id)->paginate($data['perPage']);
---
SELECT *
FROM `sub_categories`
WHERE `slug` = 'illustrator'
 LIMIT 1
SELECT *
FROM `posts`
WHERE `visibility` = 1
AND `category_id` = '6'
SELECT *
FROM `posts`
WHERE `visibility` = 1
AND `category_id` = '6'
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `visibility` = 1
AND `category_id` = '6'